### 3. TASK 3

Anda diberikan URL API (https://stein.efishery.com/v1/storages/5e1edf521073e315924ceab4/list). Buatlah
sebuah program sederhana yang mampu menghasilkan:

    1. File CSV dengan isi agregasi datanya: Week | Komoditas | Average Price | Min Price | Max Price

    2. Week dalam format ISO Week Date

    3. Komoditas di-cleansing dengan enum yang sama, nilai null dibuang

    4. README.md dengan cara setup dan running program tersebut.

    5. History commit yang iteratif dan sesuai syntax
`http://karma-runner.github.io/4.0/dev/git-commit-msg.html`

    6. Boleh gunakan asumsi pribadi selama bisa memberikan reasoning yang common
sense. (cantumkan pada README.md)

In [2]:
# import library
import requests
import pandas as pd
import numpy as np

In [3]:
api_url = "https://stein.efishery.com/v1/storages/5e1edf521073e315924ceab4/list"

# Get data about NYC cafes from the Yelp API
response = requests.get(api_url)

# Extract JSON data from the response
data = response.json()

In [4]:
# Load data to a data frame
fish_data = pd.DataFrame(data)

# View the data's dtypes
print(fish_data.dtypes)

uuid             object
komoditas        object
area_provinsi    object
area_kota        object
size             object
price            object
tgl_parsed       object
timestamp        object
dtype: object

In [5]:
# Load json_normalize()
from pandas.io.json import json_normalize

# Isolate the JSON data from the API response
data = response.json()

# Flatten fish data into a data frame, replace separator
fish_data =  pd.json_normalize(data,
             sep = '_')

# View data
print(fish_data.head())

   uuid komoditas area_provinsi area_kota  size price tgl_parsed timestamp
0  None      None          None      None  None  None       None      None
1  None      None          None      None  None  None       None      None
2  None      None          None      None  None  None       None      None
3  None      None          None      None  None  None       None      None
4  None      None          None      None  None  None       None      None

In [6]:
fish_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   uuid           128 non-null    object
 1   komoditas      139 non-null    object
 2   area_provinsi  141 non-null    object
 3   area_kota      140 non-null    object
 4   size           142 non-null    object
 5   price          140 non-null    object
 6   tgl_parsed     125 non-null    object
 7   timestamp      124 non-null    object
dtypes: object(8)
memory usage: 13.6+ KB

In [7]:
fish_data.describe

<bound method NDFrame.describe of                                      uuid komoditas area_provinsi  area_kota  \
0                                    None      None          None       None
1                                    None      None          None       None
2                                    None      None          None       None
3                                    None      None          None       None
4                                    None      None          None       None
..                                    ...       ...           ...        ...
210  ad468ea4-6e12-4d7a-ae5b-c04de70c8ba8     Test1          ACEH  ACEH KOTA
211  e87c72a4-168c-416e-b2a0-7f3b9f5f8986     Gabus    JAWA BARAT    CIREBON
212  32719dd1-363c-4fcb-85a8-799ad002c345  Muhammad   DKI JAKARTA   KOTA TUA
213  85523eda-380a-4e69-9f55-135ff7964520      Ikan    JAWA BARAT    BANDUNG
214  7e289cd3-ec95-4961-91be-4abd8f8d7f90   Bandeng    JAWA TIMUR   SURABAYA

     size   price                 tgl_parsed      timestamp
0    None    None                       None           None
1    None    None                       None           None
2    None    None                       None           None
3    None    None                       None           None
4    None    None                       None           None
..    ...     ...                        ...            ...
210    30      34  2021-04-16T11:36:41+07:00     1618547801
211    50   13500  2021-04-16T13:25:57+07:00  1618554357449
212    40  200000  2021-04-16T22:21:32+07:00  1618586492888
213    20   20000   2021-04-16T15:35:28.337Z  1618587328337
214    25   20000   2021-04-16T15:35:52.331Z  1618587352331

[215 rows x 8 columns]>

In [8]:
fish_data1 = fish_data.dropna()
fish_data1.describe

<bound method NDFrame.describe of                                      uuid komoditas area_provinsi   area_kota  \
16   0c192840-7ee4-11ea-b3e1-e335da5df3hj    Cupang    JAWA BARAT      CIMAHI
19   06d33985-cc46-4829-bc46-ca81efd3d936    Arwana        BANTEN  PANDEGLANG
24   ee264a90-906a-466b-a7e2-333b7eee755d     Gabus   JAWA TENGAH    PEMALANG
26   fdce108e-70f6-4ae3-b1ce-4445484c5f8d      Lele    JAWA BARAT     CIREBON
27     kotlin.random.XorWowRandom@812983c     Gabus          BALI    BULELENG
..                                    ...       ...           ...         ...
210  ad468ea4-6e12-4d7a-ae5b-c04de70c8ba8     Test1          ACEH   ACEH KOTA
211  e87c72a4-168c-416e-b2a0-7f3b9f5f8986     Gabus    JAWA BARAT     CIREBON
212  32719dd1-363c-4fcb-85a8-799ad002c345  Muhammad   DKI JAKARTA    KOTA TUA
213  85523eda-380a-4e69-9f55-135ff7964520      Ikan    JAWA BARAT     BANDUNG
214  7e289cd3-ec95-4961-91be-4abd8f8d7f90   Bandeng    JAWA TIMUR    SURABAYA

    size   price                 tgl_parsed      timestamp
16   101   20100  2020-06-01T00:00:00+07:00     1590944400
19    40   20000  2021-04-14T13:04:55+07:00     1618380295
24   180   20000   2020-06-07T16:41:26.328Z  1591522886328
26    50   50000   2020-06-08T10:45:53.965Z  1591587953965
27   130   20000   2020-06-08T10:45:53.965Z  1591587953965
..   ...     ...                        ...            ...
210   30      34  2021-04-16T11:36:41+07:00     1618547801
211   50   13500  2021-04-16T13:25:57+07:00  1618554357449
212   40  200000  2021-04-16T22:21:32+07:00  1618586492888
213   20   20000   2021-04-16T15:35:28.337Z  1618587328337
214   25   20000   2021-04-16T15:35:52.331Z  1618587352331

[120 rows x 8 columns]>

In [9]:
fish_data1.head()

,uuid,komoditas,area_provinsi,area_kota,size,price,tgl_parsed,timestamp
16,0c192840-7ee4-11ea-b3e1-e335da5df3hj,Cupang,JAWA BARAT,CIMAHI,101,20100,2020-06-01T00:00:00+07:00,1590944400
19,06d33985-cc46-4829-bc46-ca81efd3d936,Arwana,BANTEN,PANDEGLANG,40,20000,2021-04-14T13:04:55+07:00,1618380295
24,ee264a90-906a-466b-a7e2-333b7eee755d,Gabus,JAWA TENGAH,PEMALANG,180,20000,2020-06-07T16:41:26.328Z,1591522886328
26,fdce108e-70f6-4ae3-b1ce-4445484c5f8d,Lele,JAWA BARAT,CIREBON,50,50000,2020-06-08T10:45:53.965Z,1591587953965
27,kotlin.random.XorWowRandom@812983c,Gabus,BALI,BULELENG,130,20000,2020-06-08T10:45:53.965Z,1591587953965

Week | Komoditas | Average Price | Min Price | Max Price

In [10]:
fish_data1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 120 entries, 16 to 214
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   uuid           120 non-null    object
 1   komoditas      120 non-null    object
 2   area_provinsi  120 non-null    object
 3   area_kota      120 non-null    object
 4   size           120 non-null    object
 5   price          120 non-null    object
 6   tgl_parsed     120 non-null    object
 7   timestamp      120 non-null    object
dtypes: object(8)
memory usage: 8.4+ KB

In [11]:
# pritn max value of fish_data1
print(fish_data1["price"].describe())

count       120
unique       53
top       20000
freq         20
Name: price, dtype: object

In [12]:
# short by date
fish_data1.sort_values("tgl_parsed", ascending=False)

,uuid,komoditas,area_provinsi,area_kota,size,price,tgl_parsed,timestamp
212,32719dd1-363c-4fcb-85a8-799ad002c345,Muhammad,DKI JAKARTA,KOTA TUA,40,200000,2021-04-16T22:21:32+07:00,1618586492888
214,7e289cd3-ec95-4961-91be-4abd8f8d7f90,Bandeng,JAWA TIMUR,SURABAYA,25,20000,2021-04-16T15:35:52.331Z,1618587352331
213,85523eda-380a-4e69-9f55-135ff7964520,Ikan,JAWA BARAT,BANDUNG,20,20000,2021-04-16T15:35:28.337Z,1618587328337
211,e87c72a4-168c-416e-b2a0-7f3b9f5f8986,Gabus,JAWA BARAT,CIREBON,50,13500,2021-04-16T13:25:57+07:00,1618554357449
210,ad468ea4-6e12-4d7a-ae5b-c04de70c8ba8,Test1,ACEH,ACEH KOTA,30,34,2021-04-16T11:36:41+07:00,1618547801
...,...,...,...,...,...,...,...,...
29,kotlin.random.XorWowRandom@64a9d2f,Gabus,BALI,BULELENG,140,25000,2020-06-08T10:46:21.374Z,1591587981374
27,kotlin.random.XorWowRandom@812983c,Gabus,BALI,BULELENG,130,20000,2020-06-08T10:45:53.965Z,1591587953965
26,fdce108e-70f6-4ae3-b1ce-4445484c5f8d,Lele,JAWA BARAT,CIREBON,50,50000,2020-06-08T10:45:53.965Z,1591587953965
24,ee264a90-906a-466b-a7e2-333b7eee755d,Gabus,JAWA TENGAH,PEMALANG,180,20000,2020-06-07T16:41:26.328Z,1591522886328
16,0c192840-7ee4-11ea-b3e1-e335da5df3hj,Cupang,JAWA BARAT,CIMAHI,101,20100,2020-06-01T00:00:00+07:00,1590944400

In [13]:
# import datetime
import datetime

# get date from tgl_parsed
date_iso = fish_data1.tgl_parsed

In [14]:
date_iso = pd.to_datetime(date_iso, utc=True)

In [15]:
print(date_iso)

16           2020-05-31 17:00:00+00:00
19           2021-04-14 06:04:55+00:00
24    2020-06-07 16:41:26.328000+00:00
26    2020-06-08 10:45:53.965000+00:00
27    2020-06-08 10:45:53.965000+00:00
                    ...
210          2021-04-16 04:36:41+00:00
211          2021-04-16 06:25:57+00:00
212          2021-04-16 15:21:32+00:00
213   2021-04-16 15:35:28.337000+00:00
214   2021-04-16 15:35:52.331000+00:00
Name: tgl_parsed, Length: 120, dtype: datetime64[ns, UTC]

In [16]:
# convert global date into iso weekdays
date_iso = pd.to_datetime(date_iso).dt.strftime('%Y-%V')

In [17]:
print(date_iso)

16     2020-22
19     2021-15
24     2020-23
26     2020-24
27     2020-24
        ...
210    2021-15
211    2021-15
212    2021-15
213    2021-15
214    2021-15
Name: tgl_parsed, Length: 120, dtype: object

In [18]:
# insert date into original dateframe
fish_data1.describe()

df = pd.DataFrame(fish_data1[["komoditas", "price"]])

In [19]:
df.head()

   komoditas  price
16    Cupang  20100
19    Arwana  20000
24     Gabus  20000
26      Lele  50000
27     Gabus  20000

In [20]:
df['week'] = date_iso

In [21]:
df

    komoditas   price     week
16     Cupang   20100  2020-22
19     Arwana   20000  2021-15
24      Gabus   20000  2020-23
26       Lele   50000  2020-24
27      Gabus   20000  2020-24
..        ...     ...      ...
210     Test1      34  2021-15
211     Gabus   13500  2021-15
212  Muhammad  200000  2021-15
213      Ikan   20000  2021-15
214   Bandeng   20000  2021-15

[120 rows x 3 columns]

In [22]:
df.dtypes

komoditas    object
price        object
week         object
dtype: object

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 120 entries, 16 to 214
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   komoditas  120 non-null    object
 1   price      120 non-null    object
 2   week       120 non-null    object
dtypes: object(3)
memory usage: 3.8+ KB

In [24]:
#convert price into numberic
df["price"] = pd.to_numeric(df.price, errors='coerce')

In [25]:
df

    komoditas     price     week
16     Cupang   20100.0  2020-22
19     Arwana   20000.0  2021-15
24      Gabus   20000.0  2020-23
26       Lele   50000.0  2020-24
27      Gabus   20000.0  2020-24
..        ...       ...      ...
210     Test1      34.0  2021-15
211     Gabus   13500.0  2021-15
212  Muhammad  200000.0  2021-15
213      Ikan   20000.0  2021-15
214   Bandeng   20000.0  2021-15

[120 rows x 3 columns]

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 120 entries, 16 to 214
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   komoditas  120 non-null    object
 1   price      118 non-null    float64
 2   week       120 non-null    object
dtypes: float64(1), object(2)
memory usage: 3.8+ KB

In [27]:
grouped = df.groupby(["komoditas"])

In [28]:
df4 = grouped.aggregate(np.sum)

In [29]:
df4

                     price
komoditas
Arwana             20000.0
Asin                5000.0
Bandeng           800000.0
Bandeng Gundala   200000.0
Bandeng Keren     100000.0
...                    ...
Udang Vannamee     50000.0
Udang Vannamei   2364089.0
Udang Windu        20000.0
ao                    22.0
asdf                   0.0

[62 rows x 1 columns]

In [30]:
type(df4)

pandas.core.frame.DataFrame

In [31]:
grouped.aggregate(np.sum)

                     price
komoditas
Arwana             20000.0
Asin                5000.0
Bandeng           800000.0
Bandeng Gundala   200000.0
Bandeng Keren     100000.0
...                    ...
Udang Vannamee     50000.0
Udang Vannamei   2364089.0
Udang Windu        20000.0
ao                    22.0
asdf                   0.0

[62 rows x 1 columns]

In [32]:
import missingno as msno
import matplotlib.pyplot as plt